namespace EMS
{
    class ErrorClass
    {
        //告警级别 0 ,1 ,2 ,3
        public static int[] EMSErrorsPower =
        {
            3,2,3,2,3,3,2,3,3,3,3,3,2,2,2,0,
            1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,2,
            3,0,0,0,0,0,0,3,0,0,0,3,0,3,3,3,
            2,2,2,2,0,0,0,0,0,0,0,0,0,0,0,0
        };

        public static string[] EMSErrors =
        {
            "关口表通讯异常",
            "储能表通讯异常",
            "设备表通讯异常",
            "辅组表通讯异常",//4
            "PCS通讯异常",
            "BMS通讯异常",
            "空调通讯异常",
            "消防通讯异常",//4
            "主EMS通讯异常",
            "从EMS通讯异常",
            "存储空间异常",
            "MYSQL异常",//4
            "UPS通讯异常",
            "液冷通讯异常",
            "4G通信异常",
            "",//0-15
            //2
"烟雾预警",//16             
"烟雾告警",
"烟雾保护",
"柜内温度高温预警",
"柜内温度高温告警",
"柜内温度高温保护",
"柜内温度低温预警",
"柜内温度低温告警",
"柜内温度低温保护",
"柜内湿度预警",
"柜内湿度告警",
"柜内湿度保护",
"一氧化碳预警",
"一氧化碳告警",
"一氧化碳保护",
"水浸报警1",
//3
"水浸报警2", 
"氢气预警（预留）",//32
"氢气告警（预留）",
"氢气保护（预留）",
"门禁保护（预留）",
"水平度及震动反馈告警（预留）",
"水平度及震动反馈保护（预留）",
"被动消防触发保护",
"主动消防动作，消防失效",
"配电断路器脱扣反馈1（预留）",
"配电断路器脱扣反馈2（预留）",
"急停故障",
"HMI通讯故障（预留）",
"逆流预警",
"逆流告警",
"逆流保护",
//4
"汇流柜门禁保护",//48
"交流侧防雷故障",
"并网柜掉电",
"客户侧掉电",
"5","6","7","8","9","10","11","12","13","14","15","16"
        };

        public static int[] PCSErrorsPower1 =
           {3,3,3,3,0,0,3,0,0,3,3,3,3,3,3,0,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            0,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3};
        public static string[] PCSErrors1 =
        {
            //1
            "FPGA 硬件故障-A 相硬件过流" ,
            "FPGA 硬件故障-B 相硬件过流",
            "FPGA 硬件故障-C 相硬件过流",
            "FPGA 硬件故障-N 相硬件过流",
            "FPGA 硬件故障-保留4",
            "FPGA 硬件故障-保留5",
            "FPGA 硬件故障-单元直压故障",
            "FPGA 硬件故障-保留7",
            "FPGA 硬件故障-保留8",
            "FPGA 硬件故障-开关电源欠压",
            "FPGA 软件故障-A 相 IGBT 故障",
            "FPGA 硬件故障-B 相 IGBT 故障",
            "FPGA 硬件故障-C 相 IGBT 故障",
            "FPGA 硬件故障-N 相 IGBT 故障",
            "FPGA 硬件故障-过温故障",
            "FPGA 硬件15",
            //2
            "ARM 软件故障-A 相输出过流",
            "ARM 软件故障-A 相输出速断",
            "ARM 软件故障-B 相输出过流",
            "ARM 软件故障-B 相输出速断",
            "ARM 软件故障-C 相输出过流",
            "ARM 软件故障-C 相输出速断",
            "ARM 软件故障-N 相输出速断",
            "ARM 软件故障-N 相输出速断",
            "ARM 软件故障-交流过压",
            "ARM 软件故障-交流欠压",
            "ARM 软件故障-交流过频",
            "ARM 软件故障-交流欠频",
            "ARM 软件故障-电压 THDU 超限",
            "ARM 软件故障-系统缺相",
            "ARM 软件故障-系统相序错误",
            "ARM 软件故障-直流极性反接",
            //3
            "ARM 软件故障-直流母线软件过压",
            "ARM 软件故障-直流母线软件欠压",
            "ARM 软件故障-系统过频率",
            "ARM 软件故障-系统欠频率",
            "ARM 软件故障-直流充电过流",
            "ARM 软件故障-直流放电过流",
            "ARM 软件故障-孤岛保护",
            "ARM 软件故障-保留",
            "ARM 软件故障-交流主接合闸故障",
            "ARM 软件故障-交流主接分闸故障",
            "ARM 软件故障-交流软启合闸故障",
            "ARM 软件故障-交流软启分闸故障",
            "ARM 软件故障-直流主接合闸故障",
            "ARM 软件故障-直流主接分闸故障",
            "ARM 软件故障-直流软启合闸故障",
            "ARM 软件故障-直流软启合闸故障",
            //4
            "ARM 软件故障-铁电参数存储错误",
            "ARM 软件故障-直流软起失败",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-起机条件不满足",
            "ARM 软件故障-运行中开关故障",
            "ARM 软件故障-逆变启动超时",
            "ARM 软件故障-参数下发设置错误",
            "ARM 软件故障-BMS 通讯故障",
            "ARM 软件故障-BMS 温度异常",
            "ARM 软件故障-BMS 跳机",
            "ARM 软件故障-BMS 电池告警",
            "ARM 软件故障-DCDC 通讯故障",
            "ARM 软件故障-EMS 通讯故障",
            "ARM 软件故障-急停或熔芯故障",
            "ARM 软件故障-保留",
            //5
            "ARM 软件故障-保留",
            "ARM 软件故障-电池软件过压",
            "ARM 软件故障-电池软件欠压",
            "ARM 软件故障-母线不平衡异常",
            "RM 软件故障-母线半直压过压",
            "ARM 软件故障-DCDC 启动超时",
             "ARM 软件故障-保留",
              "ARM 软件故障-保留",
               "ARM 软件故障-保留",
                "ARM 软件故障-保留",
                 "ARM 软件故障-保留",
                  "ARM 软件故障-保留",
                  "ARM 软件故障-保留",
                "ARM 软件故障-保留",
                 "ARM 软件故障-保留",
                  "ARM 软件故障-保留",
            //6
            "FPGA 硬件故障-直流 1#硬件过流",
            "FPGA 硬件故障-直流 2#硬件过流",
            "FPGA 硬件故障-直流 3#硬件过流",
            "FPGA 硬件故障-直流 4#硬件过流",
            "FPGA 硬件故障-保留",
            "FPGA 硬件故障-保留",
            "FPGA 硬件故障-单元直压故障",
            "FPGA 硬件故障-保留",
            "FPGA 硬件故障-保留",
            "FPGA 硬件故障-开关电源欠压",
            "FPGA 软件故障-直流 1#IGBT 故障",
            "FPGA 硬件故障-直流 2#IGBT 故障",
            "FPGA 硬件故障-直流 3#IGBT 故障",
            "FPGA 硬件故障-直流 4#IGBT 故障",
            "FPGA 硬件故障-过温故障",
            "FPGA 硬件故障-保留",
            //7
            "ARM 软件故障-直流 1#软件过流",
            "ARM 软件故障-保留 1-故障",
            "ARM 软件故障-直流 2#软件过流",
            "ARM 软件故障-保留",
            "ARM 软件故障-直流 3#软件过流 ",
            "ARM 软件故障-保留",
            "ARM 软件故障-直流 4#软件过流 ",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            //8
            "ARM 软件故障-直流输入软件过压",
            "ARM 软件故障-直流输入软件欠压",
            "ARM 软件故障-直流输出软件过压",
            "ARM 软件故障-直流输出软件欠压",
            "ARM 软件故障-软件温度故障",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-直流极性反接",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            //9
            "ARM 软件故障-CMS 通讯故障",
            "ARM 软件故障-CMS 电池温度异常",
            "ARM 软件故障-CMS 跳机",
            "ARM 软件故障-CMS 温度告警",
            "ARM 软件故障-PCS 通讯故障",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留",
            "ARM 软件故障-保留"
        };

        //11.16 修改C1B1A1C2B2A2温度传感器故障等级 3->2
        public static int[] PCSErrorsPower2 =
          {2,2,2,2,2,3,3,3,2,2,3,3,3,3,3,2,
            3,2,2,3,3,3,3,3,2,2,2,2,2,2,2,2,
            3,3,3,2,2,2,2,2,1,1,2,2,2,2,2,2,
            3,3,2,2,2,2,2,2,2,2,2,2,2,2,2,2};

        public static string[] PCSErrors2 =
        {
           "过载告警",
            "母线中点不均告警",
            "DC侧主继电器告警",
            "AC电压采样异常告警",
            "DC电压采样故障告警",
            "模块地址异常故障",
            "系统主机存在地址冲突故障",
            "系统存在地址冲突故障",
            "CANB通信异常告警",
            "输入阻抗告警",
            "输入阻抗故障",
            "电网谐振故障",
            "直流软件软起故障",
            "交流侧硬件软起故障",
            "直流侧硬件软起故障",
            "锁相告警",

            "急停故障",
            "逆变欠压告警",
            "逆变过压告警",
            "风机3故障",
            "风机2故障",
            "风机1故障",
            "并机CANA通信故障",
            "辅助电源故障",
            "模组 C2相过流告警",
            "模组 B2相过流告警",
            "模组 A2相过流告警",
            "模组 C1相过流告警",
            "模组 B1相过流告警",
            "模组 A1相过流告警",
            "负母线二级过压告警",
            "正母线二级过压告警",


            "RS485通信故障",
            "交流电流采样故障",
            "交流输出短路故障",
            "逆变幅值锁定告警",
            "逆变相序告警",
            "电网相序告警",
            "直流端口欠压告警",
            "直流端口过压告警",
            "负母线一级过压告警",
            "正母线一级过压告警",
            "母线总压过低告警",
            "母线总压过高告警",
            "电网频率低告警",
            "电网频率高告警",
            "电网电压低告警",
            "电网电压高告警",


            "DSP软件版本不匹配故障",
            "AC恒压模式下电网接入故障",
            "模组C1温度传感器故障",
            "模组B1温度传感器故障",
            "模组A1温度传感器故障",
            "模组C2温度传感器故障",
            "模组B2温度传感器故障",
            "模组A2温度传感器故障",
            "模组C1温度过高告警",
            "模组B1温度过高告警",
            "模组A1温度过高告警",
            "模组C2温度过高告警",
            "模组B2温度过高告警",
            "模组A2温度过高告警",
            "出风口环境温度过高告警",
            "进风口环境温度过高告警"


        };

        public static int[] BMSErrorsPower =
           {3,3,3,3,3,3,3,3,3,1,1,3,3,0,0,0,
            1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
            2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,
            3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3};
        public static string[] BMSErrors =
        {
            //0故障 （低位）
            "BMU硬件故障",
            "BCU硬件故障",
            "熔断器故障",
            "接触器粘连故障",//3
            "BMU通信故障",
            "BAU通信故障",
            "电流传感器故障",
            "绝缘监测设备故障",//7
            "隔开开关异常断开",
            "NTC故障",
            "PCS通信故障",
            "总正接触器断开",//11
            "总负接触器断开","","","",
            //1 报警
            "总电压过压一级报警",
            "总电压欠压一级报警",
            "单体过压一级报警",
            "单体欠压一级报警",
            "放电电流过大一级报警",
            "充电电流过大一级报警",
            "放电电池过温一级报警",
            "放电电池欠温一级报警",
            "充电电池过温一级报警",
            "充电电池欠温一级报警",
            "绝缘阻值过低一级报警",
            "极柱温度过高一级报警",
            "高压箱连接器温度过高一级报警",
            "单体压差过高一级报警",
            "单体温差过高一级报警",
            "SOC低一级报警",
            //2
            "总电压过压二级报警",
            "总电压欠压二级报警",
            "单体过压二级报警",
            "单体欠压二级报警",
            "放电电流过大二级报警",
            "充电电流过大二级报警",
            "放电电池过温二级报警",
            "放电电池欠温二级报警",
            "充电电池过温二级报警",
            "充电电池欠温二级报警",
            "绝缘阻值过低二级报警",
            "极柱温度过高二级报警",
            "高压箱连接器温度过高二级报警",
            "单体压差过高二级报警",
            "单体温差过高二级报警",
            "SOC低二级报警",
            //3三级报警 
            "总电压过压三级报警",
            "总电压欠压三级报警",
            "单体过压三级报警",
            "单体欠压三级报警",
            "放电电流过大三级报警",
            "充电电流过大三级报警",
            "放电电池过温三级报警",
            "放电电池欠温三级报警",
            "充电电池过温三级报警",
            "充电电池欠温三级报警",
            "绝缘阻值过低三级报警",
            "极柱温度过高三级报警",
            "高压箱连接器温度过高三级报警",
            "单体压差过高三级报警",
            "单体温差过高三级报警",
            "SOC低三级报警",
             //BMU通讯故障
             "BMU1通讯故障",
             "BMU2通讯故障",
             "BMU3通讯故障",
             "BMU4通讯故障",
             "BMU5通讯故障",
             "BMU6通讯故障",
             "BMU7通讯故障",
             "BMU8通讯故障",
             "BMU9通讯故障",
             "BMU10通讯故障",
             "BMU11通讯故障",
             "BMU12通讯故障",
             "BMU13通讯故障",
             "BMU14通讯故障",
             "BMU15通讯故障",
             "BMU16通讯故障"
        };

        public static int[] TCErrorPower = {
            3, 3, 3, 3, 3, 3, 2, 2,
            2, 2, 2, 2, 3, 3, 3, 3,
            3, 0, 0, 3, 3, 3, 3, 3,
            3, 3, 3, 3, 3, 0, 3, 0};

        public static string[] TCErrors =
        {
            "内风机故障",//0
            "压缩机高压",
            "压缩机低压",
            "烟感报警",
            "电源故障",
            "电加热保护",
            "室内温度过高",
            "室内温度过低",

            "室内湿度过高",
            "室内湿度过低",
            "冷凝温度过高",
            "内盘温度过低",
            "室内湿度传感器故障",
            "室内温度传感器故障",
             "冷凝温度传感器故障",
            "蒸发温度传感器故障",

            "三相电故障",
            "",//17
            "",//18
            "供液温度故障",
            "强制制冷室温超低",
            "强制制热室温超高",
            "制冷温差保护",
            "制热温差保护",

            "出风温度传感器故障",
            "送风温度传感器故障",
            "户外温度传感器故障",
            "供液温度过高",
            "冷凝温度预警",
            "蒸发温度预警",
            "水浸报警",//30
                ""
        };


        public static int[] LCErrorPower = {
            3,3,3,3,0,3,3,3,3,3,3,3,3,3,3,3,
            0,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,
        };
        public static string[] LCErrors =
        {
            "出水高温",//0
            "出水低温",
            "出水温感故障",
            "回水温感故障",
            "保留",
            "变频器通讯故障",
            "系统高压锁定",
            "系统低压锁定",
            "排气温度过高锁定",
            "变频器过流锁定",
            "变频器过温锁定",
            "变频器过压锁定",
            "变频器欠压锁定",
            "变频器缺相锁定",
            "变频器其他故障锁定",
            "当前告警最高等级",

            "保留",//16
            "补水告警",
            "系统压力过高告警",
            "出水压力过高告警",
            "进水压力传感器故障",
            "出水压力传感器故障",
            "","","","","","","","","",""

        };

    }

}
